package com.cdhgold.anabada.util;
/*
 * 주소  구/시 체크
 *  0서울
 1부산
2 대구
3 인천
4 광주
5 대전
6 울산
7 세종시
8 경기도
9 강원도
10 충청북도
 11충청남도
12 전라북도
 13전라남도
 14경상북도
 15경상남도
 16제주

 */
public class ChkAddr2 implements CheckAdd {
	int ichk = 0;
	public ChkAddr2(int ichk) {
		this.ichk = ichk; // 시 도 인덱스 , 0 이면 서울 ,7 세종시

	}
	//서울
	private String[] s0= {
	};
	// 부산
	private String[] s1= {   "중구"
			,"서구"
			,"동구"
			,"영도구"
			,"부산진구"
			,"동래구"
			,"남구"
			,"북구"
			,"해운대구"
			,"사하구"
			,"금정구"
			,"강서구"
			,"연제구"
			,"수영구"
			,"사상구"
			,"기장군"
	};
	//대구
	private String[] s2= {   "중구"
			,"동구"
			,"서구"
			,"남구"
			,"북구"
			,"수성구"
			,"달서구"
			,"달성군"
	};
	//인천
	private String[] s3= {  "중구"
			,"동구"
			,"남구"
			,"연수구"
			,"남동구"
			,"부평구"
			,"계양구"
			,"서구"
			,"미추홀구"
			,"강화군"
			,"옹진군"
	};
	//광주 특별시
	private String[] s4= {   "동구"
			,"서구"
			,"남구"
			,"북구"
			,"광산구"
	};
	//대전
	private String[] s5= { "동구"
			,"중구"
			,"서구"
			,"유성구"
			,"대덕구"
	};
	//울산
	private String[] s6= {   "중구"
			,"남구"
			,"동구"
			,"북구"
			,"울주군"
	};
	//세종시
	private String[] s7= {
	};
	// 경기도
	private String[] s8= {   "수원시"
			,"성남시"
			,"의정부시"
			,"안양시"
			,"부천시"
			,"광명시"
			,"평택시"
			,"동두천시"
			,"안산시"
			,"고양시"
			,"과천시"
			,"구리시"
			,"남양주시"
			,"오산시"
			,"시흥시"
			,"군포시"
			,"의왕시"
			,"하남시"
			,"용인시"
			,"파주시"
			,"이천시"
			,"안성시"
			,"김포시"
			,"화성시"
			,"광주시"
			,"양주시"
			,"포천시"
			,"여주시"
			,"여주군"
			,"연천군"
			,"가평군"
			,"양평군"
	};
	// 강원도
	private String[] s9= {  "춘천시"
			,"원주시"
			,"강릉시"
			,"동해시"
			,"태백시"
			,"속초시"
			,"삼척시"
			,"홍천군"
			,"횡성군"
			,"영월군"
			,"평창군"
			,"정선군"
			,"철원군"
			,"화천군"
			,"양구군"
			,"인제군"
			,"고성군"
			,"양양군"
	};
	// 충청북도
	private String[] s10= {  "청주시"
			,"충주시"
			,"제천시"
			,"청주시"
			,"청원군"
			,"보은군"
			,"옥천군"
			,"영동군"
			,"진천군"
			,"괴산군"
			,"음성군"
			,"단양군"
			,"증평군"
	};
	// 충청남도
	private String[] s11= {  "천안시"
			,"공주시"
			,"보령시"
			,"아산시"
			,"서산시"
			,"논산시"
			,"계룡시"
			,"당진시"
			,"금산군"
			,"연기군"
			,"부여군"
			,"서천군"
			,"청양군"
			,"홍성군"
			,"예산군"
			,"태안군"
			,"당진군"
	};
	// 전라북도
	private String[] s12= {   "전주시"
			,"군산시"
			,"익산시"
			,"정읍시"
			,"남원시"
			,"김제시"
			,"완주군"
			,"진안군"
			,"무주군"
			,"장수군"
			,"임실군"
			,"순창군"
			,"고창군"
			,"부안군"
	};
	// 전라남도
	private String[] s13= {  "목포시"
			,"여수시"
			,"순천시"
			,"나주시"
			,"광양시"
			,"담양군"
			,"곡성군"
			,"구례군"
			,"고흥군"
			,"보성군"
			,"화순군"
			,"장흥군"
			,"강진군"
			,"해남군"
			,"영암군"
			,"무안군"
			,"함평군"
			,"영광군"
			,"장성군"
			,"완도군"
			,"진도군"
			,"신안군"
	};
	// 경상북도
	private String[] s14= {  "포항시"
			,"경주시"
			,"김천시"
			,"안동시"
			,"구미시"
			,"영주시"
			,"영천시"
			,"상주시"
			,"문경시"
			,"경산시"
			,"군위군"
			,"의성군"
			,"청송군"
			,"영양군"
			,"영덕군"
			,"청도군"
			,"고령군"
			,"성주군"
			,"칠곡군"
			,"예천군"
			,"봉화군"
			,"울진군"
			,"울릉군"
	};
	// 경상남도
	private String[] s15= {  "창원시"
			,"마산시"
			,"진주시"
			,"진해시"
			,"통영시"
			,"사천시"
			,"김해시"
			,"밀양시"
			,"거제시"
			,"양산시"
			,"창원시"
			,"의령군"
			,"함안군"
			,"창녕군"
			,"고성군"
			,"남해군"
			,"하동군"
			,"산청군"
			,"함양군"
			,"거창군"
			,"합천군"
	};
	// 제주
	private String[] s16= {  "제주시"
			,"서귀포시"
	};
	private String[][]  sall = {s0, s1, s2, s3, s4, s5, s6, s7,s8
			,s9 ,s10, s11, s12, s13, s14, s15, s16 };
	@Override
	public int chk(String addr) {
		int ret = 0,i = 0;
		if(ichk ==0 || ichk == 7) {

			return ichk;
		}
		String[] tmp = sall[ ichk];
		for(String s :   tmp  ) {
			int ichk = addr.indexOf(s);
			if(ichk != -1 ) {
				ret = i ;
				break;
			}
			i++;
		}// end for 
		return ret;
	}
}